Revit 2027 API
DirectShape.TypeId Property
 Element id of a DirectShapeType object that holds properties to be shared by this element. Optional.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId TypeId { get; }
Public ReadOnly Property TypeId As ElementId
	Get
public:
property ElementId^ TypeId {
	ElementId^ get ();
}
member TypeId : ElementId with get
Property Value
ElementId
See Also
Reference
DirectShape Class
Autodesk.Revit.DB Namespace